gamemoddesignbr/GameMod_ESP32-S2-S3_PS4_Server_900u/GameMod_ESP32-S2-S3_PS4_Server_900u.ino
#include <FS.h>
#include "WiFi.h"
#include "ESPAsyncWebServer.h"
#include "esp_task_wdt.h"
#include <DNSServer.h>
#include <ESPmDNS.h>
#include <Update.h>
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3) // ESP32-S2/S3 BOARDS(usb emulation)
#include "USB.h"
#include "USBMSC.h"
#include "exfathax.h"
#elif defined(CONFIG_IDF_TARGET_ESP32) // ESP32 BOARDS
#define USBCONTROL false               // set to true if you are using usb control(wired up usb drive)
#define usbPin 4                       // set the pin you want to use for usb control
#else
#error "Selected board not supported"
#endif

                      // use PsFree [ true / false ]
#define PSFREE false  // use the newer psfree webkit exploit.
                      // this is fairly stable but may fail which will require you to try and load the payload again.

                      // use SD Card [ true / false ]
#define USESD false   // a FAT32 formatted SD Card will be used instead of the onboard flash for the storage. 
                      // this requires a board with a sd card slot or a sd card connected.

                      // use FatFS not SPIFFS [ true / false ]
#define USEFAT false  // FatFS will be used instead of SPIFFS for the storage filesystem or for larger partitons on boards with more than 4mb flash. 
                      // you must select a partition scheme labeled with "FAT" or "FATFS" with this enabled.

                      // use LITTLEFS not SPIFFS [ true / false ]
#define USELFS true   // LITTLEFS will be used instead of SPIFFS for the storage filesystem. 
                      // you must select a partition scheme labeled with "SPIFFS" with this enabled and USEFAT must be false.

                      // enable internal goldhen.h [ true / false ]
#define INTHEN false  // goldhen is placed in the app partition to free up space on the storage for other payloads. 
                      // with this enabled you do not upload goldhen to the board, set this to false if you wish to upload goldhen.

                      // enable autohen [ true / false ]
#define AUTOHEN false // this will load goldhen instead of the normal index/payload selection page, use this if you only want hen and no other payloads. 
                      // you can update goldhen by uploading the goldhen payload to the board storage with the filename "goldhen.bin".

                     // enable fan threshold [ true / false ]
#define FANMOD false // this will include a function to set the consoles fan ramp up temperature in °C 
                     // this will not work if the board is a esp32 and the usb control is disabled.

//-------------------DEFAULT SETTINGS------------------//

                       // use config.ini [ true / false ]
#define USECONFIG true // this will allow you to change these settings below via the admin webpage. 
                       // if you want to permanently use the values below then set this to false.

//create access point
boolean startAP = true;
String AP_SSID = "GameMod_PS4_WiFi";
String AP_PASS = "123456789";
IPAddress Server_IP(10, 1, 1, 1);
IPAddress Subnet_Mask(255, 255, 255, 0);

//connect to wifi
boolean connectWifi = false;
String WIFI_SSID = "Home_WIFI";
String WIFI_PASS = "password";
String WIFI_HOSTNAME = "ps4.local";
boolean useWF = false;
IPAddress WIFI_LOCALIP(192, 168, 0, 250);
IPAddress WIFI_GATEWAY(192, 168, 0, 1);
IPAddress WIFI_SUBNET(255, 255, 255, 0);
IPAddress WIFI_PDNS(8, 8, 8, 8);
IPAddress WIFI_SDNS(8, 8, 4, 4);

//server port
int WEB_PORT = 80;

//Auto Usb Wait(milliseconds)
int USB_WAIT = 5000;

// Displayed firmware version
String firmwareVer = "1.00";

//ESP sleep after x minutes
boolean espSleep = false;
int TIME2SLEEP = 30; // minutes

//-----------------------------------------------------//

#include "Loader.h"

#include "Pages.h"

#include "jzip.h"

#if USESD
#include "SD.h"
#include "SPI.h"

#define SCK 12  // pins for sd card
#define MISO 13 // these values are set for the LILYGO TTGO T8 ESP32-S2 board
#define MOSI 11 // you may need to change these for other boards
#define SS 10
#define FILESYS SD
#else
#if USEFAT
#include "FFat.h"
#define FILESYS FFat
#else
#if USELFS
#include <LittleFS.h>
#define FILESYS LittleFS
#else
#include "SPIFFS.h"

#define FILESYS SPIFFS
#endif
#endif
#endif

#if INTHEN
#include "goldhen.h"
#endif

#if(!defined(USBCONTROL) | USBCONTROL) && FANMOD
#include "fan.h"
#endif

DNSServer dnsServer;
AsyncWebServer server(WEB_PORT);
boolean hasEnabled = false;
boolean isFormating = false;
long enTime = 0;
int ftemp = 70;
long bootTime = 0;
File upFile;
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
USBMSC dev;
#endif

/*
#if ARDUINO_USB_CDC_ON_BOOT
#define HWSerial Serial0
#define USBSerial Serial
#else
#define HWSerial Serial
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
USBCDC USBSerial;
#endif
#endif
*/

String split(String str, String from, String to) {
   String tmpstr = str;
   tmpstr.toLowerCase();
   from.toLowerCase();
   to.toLowerCase();
   int pos1 = tmpstr.indexOf(from);
   int pos2 = tmpstr.indexOf(to, pos1 + from.length());
   String retval = str.substring(pos1 + from.length(), pos2);
   return retval;
}

bool instr(String str, String search) {
   int result = str.indexOf(search);
   if (result == -1) {
      return false;
   }
   return true;
}

String formatBytes(size_t bytes) {
   if (bytes < 1024) {
      return String(bytes) + " B";
   } else if (bytes < (1024 * 1024)) {
      return String(bytes / 1024.0) + " KB";
   } else if (bytes < (1024 * 1024 * 1024)) {
      return String(bytes / 1024.0 / 1024.0) + " MB";
   } else {
      return String(bytes / 1024.0 / 1024.0 / 1024.0) + " GB";
   }
}

String urlencode(String str) {
   String encodedString = "";
   char c;
   char code0;
   char code1;
   char code2;
   for (int i = 0; i < str.length(); i++) {
      c = str.charAt(i);
      if (c == ' ') {
         encodedString += '+';
      } else if (isalnum(c)) {
         encodedString += c;
      } else {
         code1 = (c & 0xf) + '0';
         if ((c & 0xf) > 9) {
            code1 = (c & 0xf) - 10 + 'A';
         }
         c = (c >> 4) & 0xf;
         code0 = c + '0';
         if (c > 9) {
            code0 = c - 10 + 'A';
         }
         code2 = '\0';
         encodedString += '%';
         encodedString += code0;
         encodedString += code1;
      }
      yield();
   }
   encodedString.replace("%2E", ".");
   return encodedString;
}

void sendwebmsg(AsyncWebServerRequest * request, String htmMsg) {
   String tmphtm = "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"style.css\"></head><center><br><br><br><br><br><br>" + htmMsg + "</center></html>";
   request -> send(200, "text/html", tmphtm);
}

void handleFwUpdate(AsyncWebServerRequest * request, String filename, size_t index, uint8_t * data, size_t len, bool final) {
   if (!index) {
      String path = request -> url();
      if (path != "/update.html") {
         request -> send(500, "text/plain", "Internal Server Error");
         return;
      }
      if (!filename.equals("fwupdate.bin")) {
         sendwebmsg(request, "Invalid update file: " + filename);
         return;
      }
      if (!filename.startsWith("/")) {
         filename = "/" + filename;
      }
      //HWSerial.printf("Update Start: %s\n", filename.c_str());
      if (!Update.begin((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000)) {
         Update.printError(Serial);
         sendwebmsg(request, "Update Failed: " + String(Update.errorString()));
      }
   }
   if (!Update.hasError()) {
      if (Update.write(data, len) != len) {
         Update.printError(Serial);
         sendwebmsg(request, "Update Failed: " + String(Update.errorString()));
      }
   }
   if (final) {
      if (Update.end(true)) {
         //HWSerial.printf("Update Success: %uB\n", index+len);
         String tmphtm = "<!DOCTYPE html><html><head><meta http-equiv=\"refresh\" content=\"8; url=/info.html\"><style type=\"text/css\">body {background-color: #1451AE; color: #ffffff; font-size: 20px; font-weight: bold; margin: 0 0 0 0.0; padding: 0.4em 0.4em 0.4em 0.6em;}</style></head><center><br><br><br><br><br><br>Update Success, Rebooting.</center></html>";
         request -> send(200, "text/html", tmphtm);
         delay(1000);
         ESP.restart();
      } else {
         Update.printError(Serial);
      }
   }
}

void handleDelete(AsyncWebServerRequest * request) {
   if (!request -> hasParam("file", true)) {
      request -> redirect("/fileman.html");
      return;
   }
   String path = request -> getParam("file", true) -> value();
   if (path.length() == 0) {
      request -> redirect("/fileman.html");
      return;
   }
//   if (FILESYS.exists("/" + path) && path != "/" && !path.equals("config.ini")) {
   if (FILESYS.exists("/" + path) && path != "/") {
      FILESYS.remove("/" + path);
   }
   request -> redirect("/fileman.html");
}

void handleFileMan(AsyncWebServerRequest * request) {
   File dir = FILESYS.open("/");
   String output = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>File Manager</title><link rel=\"stylesheet\" href=\"style.css\"><style>body{overflow-y:auto;} th{border: 1px solid #dddddd; background-color:gray;padding: 8px;}</style><script>function statusDel(fname) {var answer = confirm(\"Are you sure you want to delete \" + fname + \" ?\");if (answer) {return true;} else { return false; }} </script></head><body><br><table id=filetable></table><script>var filelist = [";
   int fileCount = 0;
   while (dir) {
      File file = dir.openNextFile();
      if (!file) {
         dir.close();
         break;
      }
      String fname = String(file.name());
//      if (fname.length() > 0 && !fname.equals("config.ini") && !file.isDirectory()) {
      if (fname.length() > 0 && !file.isDirectory()) {
         fileCount++;
         fname.replace("|", "%7C");
         fname.replace("\"", "%22");
         output += "\"" + fname + "|" + formatBytes(file.size()) + "\",";
      }
      file.close();
      esp_task_wdt_reset();
   }
   if (fileCount == 0) {
      output += "];</script><center>No files found<br>You can upload files using the <a href=\"/upload.html\" target=\"mframe\"><u>File Uploader</u></a> page.</center></p></body></html>";
   } else {
      output += "];var output = \"\";filelist.forEach(function(entry) {var splF = entry.split(\"|\"); output += \"<tr>\";output += \"<td><a href=\\\"\" +  splF[0] + \"\\\">\" + splF[0] + \"</a></td>\"; output += \"<td>\" + splF[1] + \"</td>\";output += \"<td><a href=\\\"/\" + splF[0] + \"\\\" download><button type=\\\"submit\\\">Download</button></a></td>\";output += \"<td><form action=\\\"/delete\\\" method=\\\"post\\\"><button type=\\\"submit\\\" name=\\\"file\\\" value=\\\"\" + splF[0] + \"\\\" onClick=\\\"return statusDel('\" + splF[0] + \"');\\\">Delete</button></form></td>\";output += \"</tr>\";}); document.getElementById(\"filetable\").innerHTML = \"<tr><th colspan='1'><center>File Name</center></th><th colspan='1'><center>File Size</center></th><th colspan='1'><center><a href='/dlall' target='mframe'><button type='submit'>Download All</button></a></center></th><th colspan='1'><center><a href='/format.html' target='mframe'><button type='submit'>Delete All</button></a></center></th></tr>\" + output;</script></body></html>";
   }
   request -> send(200, "text/html", output);
}

void handleDlFiles(AsyncWebServerRequest * request) {
   File dir = FILESYS.open("/");
   String output = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>File Downloader</title><link rel=\"stylesheet\" href=\"style.css\"><style>body{overflow-y:auto;}</style><script type=\"text/javascript\" src=\"jzip.js\"></script><script>var filelist = [";
   int fileCount = 0;
   while (dir) {
      File file = dir.openNextFile();
      if (!file) {
         dir.close();
         break;
      }
      String fname = String(file.name());
//      if (fname.length() > 0 && !fname.equals("config.ini") && !file.isDirectory()) {
      if (fname.length() > 0 && !file.isDirectory()) {
         fileCount++;
         fname.replace("\"", "%22");
         output += "\"" + fname + "\",";
      }
      file.close();
      esp_task_wdt_reset();
   }
   if (fileCount == 0) {
      output += "];</script></head><center>No files found to download<br>You can upload files using the <a href=\"/upload.html\" target=\"mframe\"><u>File Uploader</u></a> page.</center></p></body></html>";
   } else {
      output += "]; async function dlAll(){var zip = new JSZip();for (var i = 0; i < filelist.length; i++) {if (filelist[i] != ''){var xhr = new XMLHttpRequest();xhr.open('GET',filelist[i],false);xhr.overrideMimeType('text/plain; charset=x-user-defined'); xhr.onload = function(e) {if (this.status == 200) {zip.file(filelist[i], this.response,{binary: true});}};xhr.send();document.getElementById('fp').innerHTML = 'Adding: ' + filelist[i];await new Promise(r => setTimeout(r, 50));}}document.getElementById('gen').style.display = 'none';document.getElementById('comp').style.display = 'block';zip.generateAsync({type:'blob'}).then(function(content) {saveAs(content,'esp_files.zip');});}</script></head><body onload='setTimeout(dlAll,100);'><center><br><br><br><br><div id='gen' style='display:block;'><div id='loader'></div><br><br>Generating ZIP<br><p id='fp'></p></div><div id='comp' style='display:none;'><br><br><br><br>Complete<br><br>Downloading: esp_files.zip</div></center></body></html>";
   }
   request -> send(200, "text/html", output);
}

void handlePayloads(AsyncWebServerRequest * request) {
   File dir = FILESYS.open("/");
   String output = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>ESP Server</title><link rel=\"stylesheet\" href=\"style.css\"><style>body { background-color: #1451AE; color: #ffffff; font-size: 14px; font-weight: bold; margin: 0 0 0 0.0; overflow-y:hidden; text-shadow: 3px 2px DodgerBlue;}</style><script>function setpayload(payload,title,waittime){ sessionStorage.setItem('payload', payload); sessionStorage.setItem('title', title); sessionStorage.setItem('waittime', waittime);  window.open('loader.html', '_self');}</script></head><body><center><h1>9.00 Payloads</h1>";
   int cntr = 0;
   int payloadCount = 0;
   if (USB_WAIT < 5000) {
      USB_WAIT = 5000;
   } // correct unrealistic timing values
   if (USB_WAIT > 25000) {
      USB_WAIT = 25000;
   }

