gamemoddesignbr/GameMod_ESP32-S2-S3_PS4_Server_900u/GameMod_ESP32-S2-S3_PS4_Server_900u.ino
   #if INTHEN
   payloadCount++;
   cntr++;
   output += "<a onclick=\"setpayload('goldhen.bin','" + String(INTHEN_NAME) + "','" + String(USB_WAIT) + "')\"><button class=\"btn\">" + String(INTHEN_NAME) + "</button></a>&nbsp;";
   #endif

   while (dir) {
      File file = dir.openNextFile();
      if (!file) {
         dir.close();
         break;
      }
      String fname = String(file.name());
      if (fname.endsWith(".gz")) {
         fname = fname.substring(0, fname.length() - 3);
      }
      if (fname.length() > 0 && fname.endsWith(".bin") && !file.isDirectory()) {
         payloadCount++;
         String fnamev = fname;
         fnamev.replace(".bin", "");
         output += "<a onclick=\"setpayload('" + urlencode(fname) + "','" + fnamev + "','" + String(USB_WAIT) + "')\"><button class=\"btn\">" + fnamev + "</button></a>&nbsp;";
         cntr++;
         if (cntr == 4) {
            cntr = 0;
            output += "<p></p>";
         }
      }
      file.close();
      esp_task_wdt_reset();
   }

   #if(!defined(USBCONTROL) | USBCONTROL) && FANMOD
   payloadCount++;
   output += "<br><p><a onclick='setfantemp()'><button class='btn'>Set Fan Threshold</button></a><select id='temp' class='slct'></select></p><script>function setfantemp(){var e = document.getElementById('temp');var temp = e.value;var xhr = new XMLHttpRequest();xhr.open('POST', 'setftemp', true);xhr.onload = function(e) {if (this.status == 200) {sessionStorage.setItem('payload', 'fant.bin'); sessionStorage.setItem('title', 'Fan Temp ' + temp + ' &deg;C'); localStorage.setItem('temp', temp); sessionStorage.setItem('waittime', '10000');  window.open('loader.html', '_self');}};xhr.send('temp=' + temp);}var stmp = localStorage.getItem('temp');if (!stmp){stmp = 70;}for(var i=55; i<=85; i=i+5){var s = document.getElementById('temp');var o = document.createElement('option');s.options.add(o);o.text = i + String.fromCharCode(32,176,67);o.value = i;if (i == stmp){o.selected = true;}}</script>";
   #endif

   if (payloadCount == 0) {
      output += "<msg>No .bin payloads found<br>You need to upload the payloads to the ESP32 board.<br>in the arduino ide select <b>Tools</b> &gt; <b>ESP32 Sketch Data Upload</b><br>or<br>Using a pc/laptop connect to <b>" + AP_SSID + "</b> and navigate to <a href=\"/admin.html\"><u>http://" + WIFI_HOSTNAME + "/admin.html</u></a> and upload the .bin payloads using the <b>File Uploader</b></msg></center></body></html>";
   }
   output += "</center></body></html>";
   request -> send(200, "text/html", output);
}

#if USECONFIG
void handleConfig(AsyncWebServerRequest * request) {
   if (request -> hasParam("ap_ssid", true) && request -> hasParam("ap_pass", true) && request -> hasParam("web_ip", true) && request -> hasParam("web_port", true) && request -> hasParam("subnet", true) && request -> hasParam("wifi_ssid", true) && request -> hasParam("wifi_pass", true) && request -> hasParam("wifi_host", true) && request -> hasParam("usbwait", true)) {
      AP_SSID = request -> getParam("ap_ssid", true) -> value();
      if (!request -> getParam("ap_pass", true) -> value().equals("********")) {
         AP_PASS = request -> getParam("ap_pass", true) -> value();
      }
      WIFI_SSID = request -> getParam("wifi_ssid", true) -> value();
      if (!request -> getParam("wifi_pass", true) -> value().equals("********")) {
         WIFI_PASS = request -> getParam("wifi_pass", true) -> value();
      }
      String tmpip = request -> getParam("web_ip", true) -> value();
      String tmpwport = request -> getParam("web_port", true) -> value();
      String tmpsubn = request -> getParam("subnet", true) -> value();
      String WIFI_HOSTNAME = request -> getParam("wifi_host", true) -> value();
      String WIFI_LOCALIP = request -> getParam("wifi_local_ip", true) -> value();
      String WIFI_GATEWAY = request -> getParam("wifi_gateway", true) -> value();
      String tmpua = "false";
      String tmpcw = "false";
      String tmpuw = "false";
      String tmpslp = "false";
      if (request -> hasParam("useap", true)) {
         tmpua = "true";
      }
      if (request -> hasParam("usewifi", true)) {
         tmpcw = "true";
      }
      if (request -> hasParam("usewifistaticip", true)) {
         tmpuw = "true";
      }
      if (request -> hasParam("espsleep", true)) {
         tmpslp = "true";
      }
      if (tmpua.equals("false") && tmpcw.equals("false")) {
         tmpua = "true";
      }
      int USB_WAIT = request -> getParam("usbwait", true) -> value().toInt();
      int TIME2SLEEP = request -> getParam("sleeptime", true) -> value().toInt();
      File iniFile = FILESYS.open("/config.ini", "w");
      if (iniFile) {
         iniFile.print("\r\nAP_SSID=" + AP_SSID + "\r\nAP_PASS=" + AP_PASS + "\r\nWEBSERVER_IP=" + tmpip + "\r\nWEBSERVER_PORT=" + tmpwport + "\r\nSUBNET_MASK=" + tmpsubn + "\r\nWIFI_SSID=" + WIFI_SSID + "\r\nWIFI_PASS=" + WIFI_PASS + "\r\nWIFI_HOST=" + WIFI_HOSTNAME + "\r\nWIFI_LOCALIP=" + WIFI_LOCALIP + "\r\nWIFI_GATEWAY=" + WIFI_GATEWAY + "\r\nWIFI_SUBNET=" + WIFI_SUBNET + "\r\nWIFI_PDNS=" + WIFI_PDNS + "\r\nWIFI_SDNS=" + WIFI_SDNS + "\r\nUSEWF=" + tmpuw + "\r\nUSEAP=" + tmpua + "\r\nCONWIFI=" + tmpcw + "\r\nUSBWAIT=" + USB_WAIT + "\r\nESPSLEEP=" + tmpslp + "\r\nSLEEPTIME=" + TIME2SLEEP + "\r\n");
         iniFile.close();
      }
      String htmStr = "<!DOCTYPE html><html><head><meta http-equiv=\"refresh\" content=\"8; url=/info.html\"><style type=\"text/css\">#loader {z-index: 1;width: 50px;height: 50px;margin: 0 0 0 0;border: 6px solid #f3f3f3;border-radius: 50%;border-top: 6px solid #3498db;width: 50px;height: 50px;-webkit-animation: spin 2s linear infinite;animation: spin 2s linear infinite; } @-webkit-keyframes spin {0%{-webkit-transform: rotate(0deg);}100%{-webkit-transform: rotate(360deg);}}@keyframes spin{0%{ transform: rotate(0deg);}100%{transform: rotate(360deg);}}body {background-color: #1451AE; color: #ffffff; font-size: 20px; font-weight: bold; margin: 0 0 0 0.0; padding: 0.4em 0.4em 0.4em 0.6em;} #msgfmt {font-size: 16px; font-weight: normal;}#status {font-size: 16px; font-weight: normal;}</style></head><center><br><br><br><br><br><p id=\"status\"><div id='loader'></div><br>Config saved<br>Rebooting</p></center></html>";
      request -> send(200, "text/html", htmStr);
      delay(1000);
      ESP.restart();
   } else {
      request -> redirect("/config.html");
   }
}
#endif

void handleReboot(AsyncWebServerRequest * request) {
   //HWSerial.print("Rebooting ESP");
   AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", rebooting_gz, sizeof(rebooting_gz));
   response -> addHeader("Content-Encoding", "gzip");
   request -> send(response);
   delay(1000);
   ESP.restart();
}

