gamemoddesignbr/GameMod_ESP32-S2-S3_PS4_Server_900u/GameMod_ESP32-S2-S3_PS4_Server_900u.ino
#if USECONFIG
void handleConfigHtml(AsyncWebServerRequest * request) {
   String tmpUa = "";
   String tmpCw = "";
   String tmpUseWF = "";
   String tmpSlp = "";
   if (startAP) {
      tmpUa = "checked";
   }
   if (connectWifi) {
      tmpCw = "checked";
   }
   if (useWF) {
      tmpUseWF = "checked";
   }
   if (espSleep) {
      tmpSlp = "checked";
   }

   String htmStr = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>Config Editor</title><style type=\"text/css\">body {background-color: #1451AE; color: #ffffff; font-size: 14px;font-weight: bold;margin: 0 0 0 0.0;padding: 0.4em 0.4em 0.4em 0.6em;}input[type=\"submit\"]:hover {background: #ffffff;color: green;}input[type=\"submit\"]:active{outline-color: green;color: green;background: #ffffff; }table {font-family: arial, sans-serif;border-collapse: collapse;}td {border: 1px solid #dddddd;text-align: left;padding: 8px;}th {border: 1px solid #dddddd; background-color:gray;text-align: center;padding: 8px;}</style></head><body><form action=\"/config.html\" method=\"post\"><center><table><tr><th colspan=\"2\"><center>Access Point</center></th></tr><tr><td>AP SSID:</td><td><input name=\"ap_ssid\" value=\"" + AP_SSID + "\"></td></tr><tr><td>AP PASSWORD:</td><td><input name=\"ap_pass\" value=\"********\"></td></tr><tr><td>AP IP:</td><td><input name=\"web_ip\" value=\"" + Server_IP.toString() + "\"></td></tr><tr><td>SUBNET MASK:</td><td><input name=\"subnet\" value=\"" + Subnet_Mask.toString() + "\"></td></tr><tr><td>START AP:</td><td><input type=\"checkbox\" name=\"useap\" " + tmpUa + "></td></tr><tr><th colspan=\"2\"><center>Web Server</center></th></tr><tr><td>WEBSERVER PORT:</td><td><input name=\"web_port\" value=\"" + String(WEB_PORT) + "\"></td></tr><tr><th colspan=\"2\"><center>Wifi Connection</center></th></tr><tr><td>WIFI SSID:</td><td><input name=\"wifi_ssid\" value=\"" + WIFI_SSID + "\"></td></tr><tr><td>WIFI PASSWORD:</td><td><input name=\"wifi_pass\" value=\"********\"></td></tr><tr><td>WIFI HOSTNAME:</td><td><input name=\"wifi_host\" value=\"" + WIFI_HOSTNAME + "\"></td></tr><tr><td>USE STATIC CONFIGURATION (OPTIONAL)?:</td><td><input type=\"checkbox\" name=\"usewifistaticip\" " + tmpUseWF + "></td></tr><tr><td>WIFI STATIC IP:</td><td><input name=\"wifi_local_ip\" value=\"" + WIFI_LOCALIP.toString() + "\"></td></tr><tr><td>WIFI GATEWAY:</td><td><input name=\"wifi_gateway\" value=\"" + WIFI_GATEWAY.toString() + "\"></td></tr><tr><td>WIFI SUBNET:</td><td><input name=\"wifi_subnet\" value=\"" + WIFI_SUBNET.toString() + "\"></td></tr><tr><td>WIFI P. DNS:</td><td><input name=\"wifi_pdns\" value=\"" + WIFI_PDNS.toString() + "\"></td></tr><tr><td>WIFI S. DNS:</td><td><input name=\"wifi_sdns\" value=\"" + WIFI_SDNS.toString() + "\"></td></tr><tr><td>CONNECT WIFI:</td><td><input type=\"checkbox\" name=\"usewifi\" " + tmpCw + "></td></tr><tr><th colspan=\"2\"><center>Auto USB Wait</center></th></tr><tr><td>WAIT TIME(ms):</td><td><input name=\"usbwait\" value=\"" + USB_WAIT + "\"></td></tr><tr><th colspan=\"2\"><center>ESP Sleep Mode</center></th></tr><tr><td>ENABLE SLEEP:</td><td><input type=\"checkbox\" name=\"espsleep\" " + tmpSlp + "></td></tr><tr><td>TIME TO SLEEP(minutes):</td><td><input name=\"sleeptime\" value=\"" + TIME2SLEEP + "\"></td></tr></table><br><input id=\"savecfg\" type=\"submit\" value=\"Save Config\"></center></form></body></html>";
   request -> send(200, "text/html", htmStr);
}
#endif

void handleFileUpload(AsyncWebServerRequest * request, String filename, size_t index, uint8_t * data, size_t len, bool final) {
   if (!index) {
      String path = request -> url();
      if (path != "/upload.html") {
         request -> send(500, "text/plain", "Internal Server Error");
         return;
      }
      if (!filename.startsWith("/")) {
         filename = "/" + filename;
      }
//      if (filename.equals("/config.ini")) {
//         return;
//      }
      //HWSerial.printf("Upload Start: %s\n", filename.c_str());
      upFile = FILESYS.open(filename, "w");
   }
   if (upFile) {
      upFile.write(data, len);
   }
   if (final) {
      upFile.close();
      //HWSerial.printf("upload Success: %uB\n", index+len);
   }
}

void handleConsoleUpdate(String rgn, AsyncWebServerRequest * request) {
   String Version = "05.050.000";
   String sVersion = "05.050.000";
   String lblVersion = "5.05";
   String imgSize = "0";
   String imgPath = "";
   String xmlStr = "<?xml version=\"1.0\" ?><update_data_list><region id=\"" + rgn + "\"><force_update><system level0_system_ex_version=\"0\" level0_system_version=\"" + Version + "\" level1_system_ex_version=\"0\" level1_system_version=\"" + Version + "\"/></force_update><system_pup ex_version=\"0\" label=\"" + lblVersion + "\" sdk_version=\"" + sVersion + "\" version=\"" + Version + "\"><update_data update_type=\"full\"><image size=\"" + imgSize + "\">" + imgPath + "</image></update_data></system_pup><recovery_pup type=\"default\"><system_pup ex_version=\"0\" label=\"" + lblVersion + "\" sdk_version=\"" + sVersion + "\" version=\"" + Version + "\"/><image size=\"" + imgSize + "\">" + imgPath + "</image></recovery_pup></region></update_data_list>";
   request -> send(200, "text/xml", xmlStr);
}

#if!USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
void handleCacheManifest(AsyncWebServerRequest * request) {
   #if!USBCONTROL
   String output = "CACHE MANIFEST\r\n";
   File dir = FILESYS.open("/");
   while (dir) {
      File file = dir.openNextFile();
      if (!file) {
         dir.close();
         break;
      }
      String fname = String(file.name());
//      if (fname.length() > 0 && !fname.equals("config.ini") && !file.isDirectory()) {
      if (fname.length() > 0 && !file.isDirectory()) {
         if (fname.endsWith(".gz")) {
            fname = fname.substring(0, fname.length() - 3);
         }
         output += urlencode(fname) + "\r\n";
      }
      file.close();
   }
   if (!instr(output, "index.html\r\n")) {
      output += "index.html\r\n";
   }
   if (!instr(output, "menu.html\r\n")) {
      output += "menu.html\r\n";
   }
   if (!instr(output, "loader.html\r\n")) {
      output += "loader.html\r\n";
   }
   if (!instr(output, "payloads.html\r\n")) {
      output += "payloads.html\r\n";
   }
   if (!instr(output, "exploit.js\r\n")) {
      output += "exploit.js\r\n";
   }
   if (!instr(output, "style.css\r\n")) {
      output += "style.css\r\n";
   }
   #if INTHEN
   if (!instr(output, "goldhen.bin\r\n")) {
      output += "goldhen.bin\r\n";
   }
   #endif
   request -> send(200, "text/cache-manifest", output);
   #else
   request -> send(404);
   #endif
}
#endif

void handleInfo(AsyncWebServerRequest * request) {
   float flashFreq = (float) ESP.getFlashChipSpeed() / 1000.0 / 1000.0;
   FlashMode_t ideMode = ESP.getFlashChipMode();
   String mcuType = CONFIG_IDF_TARGET;
   mcuType.toUpperCase();
   String output = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>System Information</title><link rel=\"stylesheet\" href=\"style.css\"></head>";
   output += "<hr>###### Software ######<br><br>";
   output += "Firmware version " + firmwareVer + "<br>";
   output += "SDK version: " + String(ESP.getSdkVersion()) + "<br><hr>";
   output += "###### Board ######<br><br>";
   output += "MCU: " + mcuType + "<br>";
   #if defined(USB_PRODUCT)
   output += "Board: " + String(USB_PRODUCT) + "<br>";
   #endif
   output += "Chip Id: " + String(ESP.getChipModel()) + "<br>";
   output += "CPU frequency: " + String(ESP.getCpuFreqMHz()) + "MHz<br>";
   output += "Cores: " + String(ESP.getChipCores()) + "<br><hr>";
   output += "###### Flash chip information ######<br><br>";
   output += "Flash chip Id: " + String(ESP.getFlashChipMode()) + "<br>";
   output += "Estimated Flash size: " + formatBytes(ESP.getFlashChipSize()) + "<br>";
   output += "Flash frequency: " + String(flashFreq) + " MHz<br>";
   output += "Flash write mode: " + String((ideMode == FM_QIO ? "QIO" : ideMode == FM_QOUT ? "QOUT" :
         ideMode == FM_DIO ? "DIO" :
         ideMode == FM_DOUT ? "DOUT" :
         "UNKNOWN")) +
      "<br><hr>";
   output += "###### Storage information ######<br><br>";
   #if USESD
   output += "Storage Device: SD<br>";
   #elif USEFAT
   output += "Filesystem: FatFs<br>";
   #elif USELFS
   output += "Filesystem: LittleFS<br>";
   #else
   output += "Filesystem: SPIFFS<br>";
   #endif
   output += "Total Size: " + formatBytes(FILESYS.totalBytes()) + "<br>";
   output += "Used Space: " + formatBytes(FILESYS.usedBytes()) + "<br>";
   output += "Free Space: " + formatBytes(FILESYS.totalBytes() - FILESYS.usedBytes()) + "<br><hr>";
   #if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
   if (ESP.getPsramSize() > 0) {
      output += "###### PSRam information ######<br><br>";
      output += "Psram Size: " + formatBytes(ESP.getPsramSize()) + "<br>";
      output += "Free psram: " + formatBytes(ESP.getFreePsram()) + "<br>";
      output += "Max alloc psram: " + formatBytes(ESP.getMaxAllocPsram()) + "<br><hr>";
   }
   #endif
   output += "###### Ram information ######<br><br>";
   output += "Ram size: " + formatBytes(ESP.getHeapSize()) + "<br>";
   output += "Free ram: " + formatBytes(ESP.getFreeHeap()) + "<br>";
   output += "Max alloc ram: " + formatBytes(ESP.getMaxAllocHeap()) + "<br><hr>";
   output += "###### Sketch information ######<br><br>";
   output += "Sketch hash: " + ESP.getSketchMD5() + "<br>";
   output += "Sketch size: " + formatBytes(ESP.getSketchSize()) + "<br>";
   output += "Free space available: " + formatBytes(ESP.getFreeSketchSpace() - ESP.getSketchSize()) + "<br><hr>";
   output += "</html>";
   request -> send(200, "text/html", output);
}

