gamemoddesignbr/GameMod_ESP32-S2-S3_PS4_Server_900u/GameMod_ESP32-S2-S3_PS4_Server_900u.ino
#if USECONFIG
void writeConfig() {
   File iniFile = FILESYS.open("/config.ini", "w");
   if (iniFile) {
      String tmpua = "false";
      String tmpcw = "false";
      String tmpuw = "false";
      String tmpslp = "false";
      if (startAP) {
         tmpua = "true";
      }
      if (connectWifi) {
         tmpcw = "true";
      }
      if (useWF) {
         tmpuw = "false";
      }
      if (espSleep) {
         tmpslp = "true";
      }
      iniFile.print("\r\nAP_SSID=" + AP_SSID + "\r\nAP_PASS=" + AP_PASS + "\r\nWEBSERVER_IP=" + Server_IP.toString() + "\r\nWEBSERVER_PORT=" + String(WEB_PORT) + "\r\nSUBNET_MASK=" + Subnet_Mask.toString() + "\r\nWIFI_SSID=" + WIFI_SSID + "\r\nWIFI_PASS=" + WIFI_PASS + "\r\nWIFI_HOST=" + WIFI_HOSTNAME + "\r\nWIFI_LOCALIP=" + WIFI_LOCALIP.toString() + "\r\nWIFI_GATEWAY=" + WIFI_GATEWAY.toString() + "\r\nWIFI_SUBNET=" + WIFI_SUBNET.toString() + "\r\nWIFI_PDNS=" + WIFI_PDNS.toString() + "\r\nWIFI_SDNS=" + WIFI_SDNS.toString() + "\r\nUSEWF=" + tmpuw + "\r\nUSEAP=" + tmpua + "\r\nCONWIFI=" + tmpcw + "\r\nUSBWAIT=" + USB_WAIT + "\r\nESPSLEEP=" + tmpslp + "\r\nSLEEPTIME=" + TIME2SLEEP + "\r\n");
      iniFile.close();
   }
}
#endif

void setup() {
      //  HWSerial.begin(115200);
      //  HWSerial.println("Version: " + firmwareVer);
      //  USBSerial.begin();

      #if USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
      pinMode(usbPin, OUTPUT);
      digitalWrite(usbPin, LOW);
      #endif

      #if USESD
      SPI.begin(SCK, MISO, MOSI, SS);
      if (FILESYS.begin(SS, SPI)) {
         #else
         if (FILESYS.begin(true)) {
            #endif

            #if USECONFIG
            if (FILESYS.exists("/config.ini")) {
               File iniFile = FILESYS.open("/config.ini", "r");
               if (iniFile) {
                  String iniData;
                  while (iniFile.available()) {
                     char chnk = iniFile.read();
                     iniData += chnk;
                  }
                  iniFile.close();

                  if (instr(iniData, "AP_SSID=")) {
                     AP_SSID = split(iniData, "AP_SSID=", "\r\n");
                     AP_SSID.trim();
                  }

                  if (instr(iniData, "AP_PASS=")) {
                     AP_PASS = split(iniData, "AP_PASS=", "\r\n");
                     AP_PASS.trim();
                  }

                  if (instr(iniData, "WEBSERVER_IP=")) {
                     String strwIp = split(iniData, "WEBSERVER_IP=", "\r\n");
                     strwIp.trim();
                     Server_IP.fromString(strwIp);
                  }

                  if (instr(iniData, "SUBNET_MASK=")) {
                     String strsIp = split(iniData, "SUBNET_MASK=", "\r\n");
                     strsIp.trim();
                     Subnet_Mask.fromString(strsIp);
                  }

                  if (instr(iniData, "WIFI_SSID=")) {
                     WIFI_SSID = split(iniData, "WIFI_SSID=", "\r\n");
                     WIFI_SSID.trim();
                  }

                  if (instr(iniData, "WIFI_PASS=")) {
                     WIFI_PASS = split(iniData, "WIFI_PASS=", "\r\n");
                     WIFI_PASS.trim();
                  }

                  if (instr(iniData, "WIFI_HOST=")) {
                     WIFI_HOSTNAME = split(iniData, "WIFI_HOST=", "\r\n");
                     WIFI_HOSTNAME.trim();
                  }

                  if (instr(iniData, "WIFI_LOCALIP=")) {
                     String strsLocalIp = split(iniData, "WIFI_LOCALIP=", "\r\n");
                     strsLocalIp.trim();
                     WIFI_LOCALIP.fromString(strsLocalIp);
                  }

                  if (instr(iniData, "WIFI_GATEWAY=")) {
                     String strsGateway = split(iniData, "WIFI_GATEWAY=", "\r\n");
                     strsGateway.trim();
                     WIFI_GATEWAY.fromString(strsGateway);
                  }

                  if (instr(iniData, "WIFI_SUBNET=")) {
                     String strsSubnet = split(iniData, "WIFI_SUBNET=", "\r\n");
                     strsSubnet.trim();
                     WIFI_SUBNET.fromString(strsSubnet);
                  }

                  if (instr(iniData, "WIFI_PDNS=")) {
                     String strsPDNS = split(iniData, "WIFI_PDNS=", "\r\n");
                     strsPDNS.trim();
                     WIFI_PDNS.fromString(strsPDNS);
                  }

                  if (instr(iniData, "WIFI_SDNS=")) {
                     String strsSDNS = split(iniData, "WIFI_SDNS=", "\r\n");
                     strsSDNS.trim();
                     WIFI_SDNS.fromString(strsSDNS);
                  }

                  if (instr(iniData, "USEWF=")) {
                     String struw = split(iniData, "USEWF=", "\r\n");
                     struw.trim();
                     if (struw.equals("true")) {
                        useWF = true;
                     } else {
                        useWF = false;
                     }
                  }

                  if (instr(iniData, "USEAP=")) {
                     String strua = split(iniData, "USEAP=", "\r\n");
                     strua.trim();
                     if (strua.equals("true")) {
                        startAP = true;
                     } else {
                        startAP = false;
                     }
                  }

                  if (instr(iniData, "CONWIFI=")) {
                     String strcw = split(iniData, "CONWIFI=", "\r\n");
                     strcw.trim();
                     if (strcw.equals("true")) {
                        connectWifi = true;
                     } else {
                        connectWifi = false;
                     }
                  }

                  if (instr(iniData, "USBWAIT=")) {
                     String strusw = split(iniData, "USBWAIT=", "\r\n");
                     strusw.trim();
                     USB_WAIT = strusw.toInt();
                  }

                  if (instr(iniData, "ESPSLEEP=")) {
                     String strsl = split(iniData, "ESPSLEEP=", "\r\n");
                     strsl.trim();
                     if (strsl.equals("true")) {
                        espSleep = true;
                     } else {
                        espSleep = false;
                     }
                  }

                  if (instr(iniData, "SLEEPTIME=")) {
                     String strslt = split(iniData, "SLEEPTIME=", "\r\n");
                     strslt.trim();
                     TIME2SLEEP = strslt.toInt();
                  }
               }
            } else {
               writeConfig();
            }
            #endif
         } else {
            //HWSerial.println("Filesystem failed to mount");
         }

         if (startAP) {
            //    USBSerial.println("SSID: " + AP_SSID);
            //HWSerial.println("Password: " + AP_PASS);
            //HWSerial.println("");
            //HWSerial.println("WEB Server IP: " + Server_IP.toString());
            //HWSerial.println("Subnet: " + Subnet_Mask.toString());
            //HWSerial.println("WEB Server Port: " + String(WEB_PORT));
            //HWSerial.println("");
            WiFi.softAPConfig(Server_IP, Server_IP, Subnet_Mask);
            WiFi.softAP(AP_SSID.c_str(), AP_PASS.c_str());
            //HWSerial.println("WIFI AP started");
            dnsServer.setTTL(30);
            dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);
            dnsServer.start(53, "*", Server_IP);
            //HWSerial.println("DNS server started");
            //HWSerial.println("DNS Server IP: " + Server_IP.toString());
         }

         if (connectWifi && WIFI_SSID.length() > 0 && WIFI_PASS.length() > 0) {
            //    USBSerial.println("WIFI MODE!");

            WiFi.setAutoConnect(true);
            WiFi.setAutoReconnect(true);

            if (useWF) {
               if (!WiFi.config(WIFI_LOCALIP, WIFI_GATEWAY, WIFI_SUBNET, WIFI_PDNS, WIFI_SDNS)) {
                  //            HWSerial.println("Failed to configure WiFi");
               }
               //        else
               //            HWSerial.println("Configure WiFi succeeded!");
            }

            WiFi.hostname(WIFI_HOSTNAME);

            WiFi.begin(WIFI_SSID.c_str(), WIFI_PASS.c_str());
            //HWSerial.println("WIFI connecting");
            if (WiFi.waitForConnectResult() != WL_CONNECTED) {
               //HWSerial.println("Wifi failed to connect");
            } else {
               IPAddress LAN_IP = WiFi.localIP();
               if (LAN_IP) {
                  //HWSerial.println("Wifi Connected");
                  //HWSerial.println("WEB Server LAN IP: " + LAN_IP.toString());
                  //HWSerial.println("WEB Server Port: " + String(WEB_PORT));
                  //HWSerial.println("WEB Server Hostname: " + WIFI_HOSTNAME);
                  String mdnsHost = WIFI_HOSTNAME;
                  mdnsHost.replace(".local", "");
                  MDNS.begin(mdnsHost.c_str());
                  if (!startAP) {
                     dnsServer.setTTL(30);
                     dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);
                     dnsServer.start(53, "*", LAN_IP);
                     //HWSerial.println("DNS server started");
                     //HWSerial.println("DNS Server IP: " + LAN_IP.toString());
                  }
               }
            }
         }

