gamemoddesignbr/GameMod_ESP32-S2-S3_PS4_Server_900u/GameMod_ESP32-S2-S3_PS4_Server_900u.ino
         server.on("/connecttest.txt", HTTP_GET, [](AsyncWebServerRequest * request) {
            request -> send(200, "text/plain", "Microsoft Connect Test");
         });
         #if!USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
         server.on("/cache.manifest", HTTP_GET, [](AsyncWebServerRequest * request) {
            handleCacheManifest(request);
         });
         #endif

//         #if USECONFIG
//         server.on("/config.ini", HTTP_ANY, [](AsyncWebServerRequest * request) {
//            request -> send(404);
//         });
//         #endif

         server.on("/upload.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", upload_gz, sizeof(upload_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         server.on(
            "/upload.html", HTTP_POST, [](AsyncWebServerRequest * request) {
               request -> redirect("/fileman.html");
            },
            handleFileUpload);

         server.on("/fileman.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            handleFileMan(request);
         });

         server.on("/delete", HTTP_POST, [](AsyncWebServerRequest * request) {
            handleDelete(request);
         });

         #if USECONFIG
         server.on("/config.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            handleConfigHtml(request);
         });

         server.on("/config.html", HTTP_POST, [](AsyncWebServerRequest * request) {
            handleConfig(request);
         });
         #endif

         server.on("/admin.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", admin_gz, sizeof(admin_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         server.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", reboot_gz, sizeof(reboot_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         server.on("/reboot.html", HTTP_POST, [](AsyncWebServerRequest * request) {
            handleReboot(request);
         });

         server.on("/update.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", update_gz, sizeof(update_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         server.on(
            "/update.html", HTTP_POST, [](AsyncWebServerRequest * request) {},
            handleFwUpdate);

         server.on("/info.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            handleInfo(request);
         });

         server.on("/usbon", HTTP_POST, [](AsyncWebServerRequest * request) {
            enableUSB();
            request -> send(200, "text/plain", "ok");
         });

         server.on("/usboff", HTTP_POST, [](AsyncWebServerRequest * request) {
            disableUSB();
            request -> send(200, "text/plain", "ok");
         });

         server.on("/format.html", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", format_gz, sizeof(format_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         server.on("/format.html", HTTP_POST, [](AsyncWebServerRequest * request) {
            isFormating = true;
            request -> send(304);
         });

         server.on("/dlall", HTTP_GET, [](AsyncWebServerRequest * request) {
            handleDlFiles(request);
         });

         server.on("/jzip.js", HTTP_GET, [](AsyncWebServerRequest * request) {
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/javascript", jzip_gz, sizeof(jzip_gz));
            response -> addHeader("Content-Encoding", "gzip");
            request -> send(response);
         });

         #if(!defined(USBCONTROL) | USBCONTROL) && FANMOD
         server.on("/setftemp", HTTP_POST, [](AsyncWebServerRequest * request) {
            if (request -> hasParam("temp", true)) {
               ftemp = request -> getParam("temp", true) -> value().toInt();
               request -> send(200, "text/plain", "ok");
            } else {
               request -> send(404);
            }
         });

         server.on("/fant.bin", HTTP_GET, [](AsyncWebServerRequest * request) {
            if (ftemp < 55 || ftemp > 85) {
               ftemp = 70;
            }
            uint8_t * fant = (uint8_t * ) malloc(sizeof(uint8_t) * sizeof(fan));
            memcpy_P(fant, fan, sizeof(fan));
            fant[250] = ftemp;
            fant[368] = ftemp;
            AsyncWebServerResponse * response = request -> beginResponse_P(200, "application/octet-stream", fant, sizeof(fan));
            request -> send(response);
            free(fant);
         });
         #endif

         server.serveStatic("/", FILESYS, "/").setDefaultFile("index.html");

         server.onNotFound([](AsyncWebServerRequest * request) {
            //HWSerial.println(request->url());
            String path = request -> url();
            if (instr(path, "/update/ps4/")) {
               String Region = split(path, "/update/ps4/list/", "/");
               handleConsoleUpdate(Region, request);
               return;
            }
            if (instr(path, "/document/") && instr(path, "/ps4/")) {
               request -> redirect("http://" + WIFI_HOSTNAME + "/index.html");
               return;
            }
            if (path.endsWith("index.html") || path.endsWith("index.htm") || path.endsWith("/")) {
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", index_gz, sizeof(index_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               return;
            }
            if (path.endsWith("style.css")) {
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/css", style_gz, sizeof(style_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               return;
            }
            #if!USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
            if (path.endsWith("menu.html")) {
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", menu_gz, sizeof(menu_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               return;
            }
            #endif
            #if PSFREE
            if (path.endsWith("exploit.js")) {
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/javascript", psf_gz, sizeof(psf_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               return;
            }
            #endif
            if (path.endsWith("payloads.html")) {
               #if AUTOHEN
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", autohen_gz, sizeof(autohen_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               #else
               handlePayloads(request);
               #endif
               return;
            }
            if (path.endsWith("loader.html")) {
               AsyncWebServerResponse * response = request -> beginResponse_P(200, "text/html", loader_gz, sizeof(loader_gz));
               response -> addHeader("Content-Encoding", "gzip");
               request -> send(response);
               return;
            }

